carbonAppUploader.xml

<!-- <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:upl="http://upload.application.carbon.wso2.org" xmlns:xsd="http://upload.application.carbon.wso2.org/xsd"> -->
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:upl="http://upload.application.carbon.wso2.org" xmlns:xsd="http://upload.application.carbon.wso2.org/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <upl:uploadApp>
         <!--Zero or more repetitions:-->
         <upl:fileItems>
            <!--Optional:-->
            <xsd:dataHandler>cid:./az_car_file/new-ping-car_0.0.42.car</xsd:dataHandler>
            <!--Optional:-->
            <xsd:fileName>./az_car_file/new-ping-car_0.0.42.car</xsd:fileName>
            <!--Optional:-->
            <xsd:fileType>jar</xsd:fileType>
         </upl:fileItems>
      </upl:uploadApp>
   </soapenv:Body>
</soapenv:Envelope>